Repository: AyaElsifiy/Pearogram.BuildingBlocks
Catalog: Pearogram.BuildingBlocks.Application/Common/SharedResources/GeneralMessages.*.resx
Languages: ar

source: AcademicYearId, EducationTrackId, or GradeId is invalid
ar: السنة الأكاديمية أو مسار التعليم أو الصف غير موجود

source: Academic Year Id Is Required
ar: السنة الأكاديمية مطلوبة

source: Academic Year Is Required
ar: يجب ادخال السنة الدراسية

source: Academic year not found.
ar: السنة الأكاديمية غير موجود

source: Action name updated successfully
ar: تم تحديث الفعل بنجاح

source: Added Successfully
ar: تم الاضافه بنجاح

source: Admission application not found.
ar: لم يتم العثور على طلب القبول

source: Already activated.
ar: تم التفعيل من قبل

# AlreadyExistInThisTeam
source: {0} already exists in this team
ar: {0} موجود بالفعل في هذا الفريق

source: Already Exists
ar: تم الاضافه من قبل

source: An error occurred
ar: حدث خطأ

source: An Application With The Same NationalId Already Exists
ar: يوجد طلب آخر بنفس الرقم القومي

# AnErrorOccured
source: An error occurred
ar: حدث خطأ

# AnErrorOccuredWhileCreateTask
source: An error occurred while creating the task
ar: حدث خطأ أثناء إنشاء المهمة

source: An error occured while fetching data
ar: حدث خطأ أثناء جلب البيانات

# AnErrorOccuredWhileGetProjectByIdAsync
source: An error occurred while getting project by ID
ar: حدث خطأ أثناء جلب المشروع بواسطة المعرف

# AnErrorOccuredWhileGetUserById
source: An error occurred while getting user by ID
ar: حدث خطأ

source: An Error Occurred
ar: حدث خطأ

source: An error occurred while changing the password
ar: خطأ اثناء تغيير كلمة السر

source: An error occurred while processing your request
ar: حدث خطأ أثناء معالجة طلبك

source: An error occurred while send OTP
ar: خطأ اثناء ارسال رمز ال OTP

source: Application Already Approved
ar: الطلب تم الموافقه عليه من قبل

source: Application already refused.
ar: تم رفض الطلب بالفعل

source: Application Approved
ar: تم الموافقه بنجاح

source: Application Cannot Be Approved
ar: لا يمكن الموافقه علي هذا الطلب

source: Application Created Successfully
ar: تم تقديم الطلب بنجاح

source: Application duplicated successfully.
ar: تم تكرار الطلب بنجاح

source: ApplicationIds is required.
ar: الطلب مطلوب

source: Application Not Found
ar: الطلب غير موجود

source: Applications assigned successfully
ar: تم تعيين الطلبات بنجاح

source: Application status updated successfully.
ar: تم تحديث حالة الطلب بنجاح

source: Approved and enrolled successfully.
ar: تم اعتماد الطالب وتسجيله بنجاح

source: Archive Successfully
ar: تم الارشفه بنجاح

# AssessmentSlotConflictReloadAndRetry
source: Conflict: the assessment slot was modified by another request. Please reload and retry
ar: تعارض: تم تعديل فترة التقييم بواسطة طلب آخر. يرجى إعادة التحميل والمحاولة مرة أخرى

source: Assessment slot deleted successfully.
ar: تم حذف فترة التقييم بنجاح

source: AssessmentSlotId is required
ar: فترة التقييم مطلوب

source: Assessment slot not found.
ar: لم يتم العثور على فترة التقييم

source: Assigned Successfully
ar: تم التعيين بنجاح

source: At least one coordinator is required.
ar: المنسق لا يمكن أن يكون فارغًا

source: At least one coordinator must be assigned.
ar: يجب تعيين منسق واحد على الأقل

source: At least one parent is required
ar: مطلوب إدخال ولي أمر واحد على الأقل

source: At least one parent must be marked as Emergency Contact.
ar: يجب تحديد ولي أمر واحد على الأقل كجهة اتصال للطوارئ

source: At least one parent must be marked as Guardian.
ar: يجب تحديد ولي أمر واحد على الأقل كـ وصي تعليمي أساسي

source: At least one student must be assigned
ar: يجب تعيين طالب واحد على الأقل

source: At least one subject is required
ar: يجب اختيار مادة واحدة على الأقل

source: Body Cannot Exceed 2000 characters
ar: لا يمكن أن يتجاوز المحتوى 2000 حرف

source: Body Is Required
ar: المحتوى مطلوب

source: Business field cannot exceed 100 characters
ar: لا يمكن أن يتجاوز مجال العمل 100 حرف

source: Business field is required.
ar: مجال العمل مطلوب

source: Can't Change This Item Rank
ar: لا يمكن تغيير ترتيب هذا العنصر

source: Can't Convert Module Name
ar: لا يمكن تحويل هذا النوع

source: Can't Delete This Item
ar: لا يمكن حذف هذا العنصر

source: Can't delete this systematic item
ar: لا يمكن حذف هذا العنصر النظامي

source: Can't Update This Critial Notification
ar: لا يمكن تحديث هذا الإشعار الحرج

source: Cannot add grading subject system when EvaluationMethod is not GradingSystemBased.
ar: لا يمكن إضافة نظام مواد التقدير عندما لا تكون طريقة التقييم قائمة على نظام الدرجات

source: Cannot add more classes Maximum allowed classes
ar: لا يمكن إضافة المزيد من الفصول. الحد الأقصى المسموح به للفصول هو

# CannotDeleteEntityWithRelatedData
source: This item cannot be deleted because it has related data.
ar: لا يمكن حذف هذا العنصر لأنه مرتبط ببيانات أخرى.

source: Cannot Delete This Systematic Item
ar: لا يمكن مسح هذا العنصر

source: Can't Add Student Without Parents
ar: لا يمكن إضافة الطالب بدون أولياء أمور

# CantUpdateThisProjectbecauseIsArchive
source: This project cannot be updated because it is archived
ar: لا يمكن التعديل علي البروجيكت لان تم ارشفته

source: Capacity must be greater than 0.
ar: يجب أن تكون اقصي عدد أكبر من 0

source: Change Password Successfully
ar: تم تغيير كلمة المرور بنجاح

source: Channel Cannot Exceed 50 characters
ar: لا يمكن للقناة أن تتجاوز 50 حرفًا

source: Channel Is Required
ar: القناة مطلوبة

source: CityId is required.
ar: المدينة مطلوبة

source: Classes contain invalid IDs.
ar: الفصول تحتوي على قيم غير صالحة

source: Classes must be unique.
ar: يجب ألا تتكرر الفصول

# ClassIdMustBeNonEmptyGuidIfProvided
source: ClassId, if provided, must be a non-empty GUID.
ar: إذا تم تحديد الفصل، فيجب ألا يكون فارغًا

# ClassIdsContainEmptyGuid
source: ClassIds contains empty Guid.
ar: الفصول تحتوي على قيمة فارغة

source: Class Not Found
ar: الفصل غير موجود

# CleanupJobStarted
source: Cleanup job started for old deleted records
ar: بدأت مهمة تنظيف السجلات المحذوفة القديمة

source: Client deleted successfully
ar: تم حذف العميل بنجاح

source: Client Archive Status Updated Successfully
ar: تم تحديث حالة أرشفة العميل بنجاح

source: Client Not Found
ar: لم يتم العثور على العميل

source: Color Is Required
ar: يجب ادخال اللون

source: Color Must Not Exceed 20 Characters
ar: يجب الا بتجاوز اللون 20 حرف

source: Comment deleted successfully
ar: تم حذف التعليق بنجاح

source: Comment not found
ar: لم يتم العثور على التعليق

source: Comments retrieved successfully
ar: تم استرجاع التعليقات بنجاح

source: Conflict detected: Date range overlaps with an existing record.
ar: يوجد تضارب في المدة الزمنية مع سجل آخر

source: Coordinator not found in this group.
ar: لم يتم العثور على المنسق في هذه المجموعة

source: Coordinator removed successfully.
ar: تمت إزالة المنسق بنجاح

source: Coordinators assigned successfully.
ar: تم تعيين المنسقين بنجاح

source: Coordinators contain duplicates.
ar: قائمة المنسقين تحتوي على عناصر مكررة

source: Coordinators list is required.
ar: قائمة المنسقين مطلوبة

source: Create Failed
ar: حدث خطأ أثناء اعتماد الاضافة

source: Date cannot be in the past.
ar: التاريخ لا يمكن أن يكون في الماضي

source: Date of birth cannot be in the future.
ar: تاريخ الميلاد لا يمكن أن يكون في المستقبل

source: Deceased status must be specified.
ar: يجب تحديد حالة المتوفى

source: Deleted Successfully
ar: تم الحذف بنجاح

source: Department is required.
ar: القسم مطلوب

source: Dependency task updated successfully
ar: تم تحديث المهمة التابعة بنجاح

# DescriptionCannotExceed1500characters
source: Name Cannot Exceed 1500 characters
ar: الوصف لا يمكن ان يتعدى 1500حرف

source: Description Cannot Exceed 255 characters
ar: الوصف لا يمكن ان يتجاوز 255 حرف

source: Description Cannot Exceed 3000 characters
ar: الوصف لا يمكن ان يتعدى 3000 حرف

source: Description Cannot Exceed 500 Characters
ar: الوصف لا يمكن ان يتجاوز ال 500 حرف

source: Description must not exceed 2000 characters.
ar: يجب ألا تتجاوز الوصف 2000 حرف

source: Duplicate coordinator IDs are not allowed.
ar: غير مسموح بتكرار المنسقين

# DuplicateParentTypeNotAllowed
source: Duplicate ParentType is not allowed
ar: غير مسموح بتكرار نوع ولي الأمر

source: Duplicate student IDs are not allowed
ar: غير مسموح بتكرار الطلاب

source: Each application must include a father.
ar: يجب أن يتضمن كل طلب أبًا

source: Each application must include a mother.
ar: يجب أن يتضمن كل طلب أمًا

# EachApplicationMustIncludeOneRelative
source: Each application must include at least one relative.
ar: يجب أن يحتوي كل طلب على فرد قريب واحد على الأقل

source: Each student must have at least one relative assigned.
ar: يجب أن يكون لكل طالب قريب واحد على الأقل معين

# EducationTrackIdMustBeNonEmptyGuid
source: EducationTrackId, if provided, must be a non-empty GUID.
ar: إذا تم إدخال مسار التعليم، فيجب أن يكون المعرّف GUID غير فارغ

source: Education track not found
ar: مسار التعليم غير موجود

source: Education Tracks Ids Is Required
ar: نوع التعليم مطلوب

source: Education Tracks Ids Required
ar: يجب ادخال المسار التعليمي

source: Education Tracks Not Found
ar: المسار التعليمي غير موجود

source: Email Already Exists
ar: البريد الالكتروني موجود من قبل

# EmailCannotExceed00Characters
source: Email cannot exceed 100 characters.
ar: البريد الإلكتروني لا يجب أن يتجاوز 100 حرف

# EmailInvalid
source: Email must be valid.
ar: البريد الإلكتروني غير صالح

# EmailInvalidFormat
source: Email must be a valid email address.
ar: يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالحا.

# EmailIsAlreadyExist
source: Email Already Exists
ar: البريد الالكتروني موجود من قبل

source: Email is required.
ar: البريد الإلكتروني مطلوب.

source: Email Not Found
ar: البريد الإلكتروني غير موجود

# EmailOrPhoneRequiredForAutoAccount
source: Email or phone number is required when the student is enrolled in a grade that allows automatic account creation.
ar: البريد الإلكتروني أو رقم الهاتف مطلوب عند تسجيل الطالب في صف يسمح بإنشاء حساب تلقائيًا.

source: End Date Is Required
ar: تاريخ النهايه مطلوب

source: End time is required.
ar: وقت الانتهاء مطلوب

source: End time must be after start time.
ar: يجب أن يكون وقت الانتهاء بعد وقت البدء

source: Enrollment Type Is Required
ar: نوع التسجيل مطلوب

source: entity Id Is Required
ar: مطلوب إدخال معرّف الكيان

source: entity Type Is Required
ar: نوع الكيان مطلوب

# ErorrWhileSavingTheTaskImage
source: Error while saving the task image
ar: حدث خطأ أثناء حفظ صورة المهمة

source: Error occurred while deleting Client
ar: حدث خطأ أثناء حذف العميل

source: Error In Change Password
ar: خطأ في تغيير كلمة المرور

source: Error In Delete
ar: خطأ في الحذف

source: Error in delete Attachment.
ar: خطأ أثناء حذف المرفق

# ErrorInRestore
source: Error during restoration
ar: خطأ أثناء الاستعادة

source: ErrorInSave
ar: خطأ في الحفظ

source: Error In Save Document
ar: خطأ ف الحفظ

source: Error In Update
ar: خطأفي التعديل

source: Error in updated
ar: خطأ في التحديث

source: Error occurred while deleting user
ar: حدث خطأ أثناء حذف المستخدم

# ErrorWhileApprovedApplication
source: Error while approving application.
ar: حدث خطأ أثناء اعتماد الطلب

source: Error while clone task
ar: خطأ أثناء استنساخ المهمة

# ErrorWhileCreatingUser
source: Error while creating users
ar: خطأ أثناء إنشاء مستخدم

# ErrorWhileDeleteTask
source: Error while deleting the task
ar: حدث خطأ أثناء حذف المهمة

source: Error while deleting menus
ar: خطأ في حذف القائمة

# ErrorWhileFetchingGroupTasksByStatus
source: Error while fetching grouped tasks by status
ar: حدث خطأ أثناء جلب المهام المجمعة حسب الحالة

# ErrorWhileFetchingMembersDDL
source: Error while fetching members
ar: خطأ أثناء جلب أعضاء

# ErrorWhileFetchingProjectDDL
source: Error loading project list
ar: خطأ في تحميل قائمة المشاريع

# ErrorWhileFetchingProjects
source: Error loading projects
ar: خطأ في تحميل المشاريع

# ErrorWhileFetchingTeams
source: Error loading teams
ar: خطأ في تحميل الفرق

# ErrorWhileFetchingTeamsDDL
source: Error while fetching teams
ar: خطأ أثناء جلب الفرق

source: Error while fetching workLogs
ar: خطأ أثناء جلب سجلات العمل

# ErrorWhileGetTaskByID
source: Error while getting task by ID
ar: حدث خطأ أثناء جلب المهمة بواسطة المعرف

# ErrorWhileGettingProject
source: Error loading project data
ar: خطأ في تحميل بيانات المشروع

# ErrorWhileUpdateTask
source: Error while updating the task
ar: حدث خطأ

# ErrorWhileVerifyUser
source: Error while verifying user
ar: خطأ أثناء التحقق من المستخدم

source: Estimated time changed successfully
ar: تم تغيير الوقت المقدر بنجاح

source: Estimated Time Not Valid
ar: الوقت المقدر غير صالح

# EUserStatusChanged
source: User status changed
ar: تم تغيير حالة المستخدم

source: Evaluation Method Is Required
ar: طريقة التقييم مطلوبة

source: Failed to assign student to class
ar: فشل في تعيين الطالب إلى الصف

source: Failed to create group.
ar: حدث خطا اثناء اضافة المجموعة

source: Failed to delete parent
ar: خطأ أثناء حذف ولي الامر

source: Failed to save image.
ar: فشل حفظ الصورة

# FailedToSaveStudentImage
source: Failed to save student image for student.
ar: فشل حفظ صورة الطالب

source: Failed To Update Group
ar: حدث خطا اثناء تعديل الجروب

source: File removed successfully
ar: تم إزالة الملف بنجاح

source: File uploaded successfully
ar: تم رفع الملف بنجاح

source: File Name Already Exists
ar: اسم الملف موجود بالفعل

source: File Name Cannot Exceed 150 characters
ar: اسم للفايل لا يمكن انا يتجاوز 150 حرف

source: File Name Is Required
ar: اسم الملف مطلوب

# FileNameIsRequiredWhenImageBase64Given
source: FileName is required when ImageBase64 is provided.
ar: يجب تحديد اسم الملف عند تقديم الصورة بصيغة Base64

source: First Language Id Is Required
ar: اللغة الأولى مطلوبة

source: From Age Is Required
ar: من فضلك أدخل العمر من

source: Full name cannot be whitespace.
ar: الاسم الكامل لا يمكن أن يكون فارغًا أو مسافات فقط

source: Full name is required.
ar: الاسم الكامل مطلوب

source: Gender is invalid or not specified
ar: النوع غير صحيح أو لم يتم اختياره.

# GradeArchiveSuccessfully
source: Grade archived successfully.
ar: تم أرشفة الصف بنجاح

source: GradeId is required.
ar: الصف الدراسي مطلوب

source: Grade Id Required
ar: كود الصف مطلوب

# GradeIdsRequired
source: Grade Id Required
ar: يجب ادخال الصف الدراسي

source: Grade not found
ar: الصف الدراسي غير موجود

# GradeNotFoundEnterValidGrade
source: Grade not found, enter a valid grade.
ar: لم يتم العثور على الصف، يرجى إدخال صف صحيح

source: Grades Configs Is Required
ar: أعدادات الصفوف للمواد مطلوب

source: Grading Method Is Required
ar: يجب ادخال نوع الدرجات

source: Group created successfully.
ar: تم إنشاء المجموعة بنجاح

source: Group Name Already Exists
ar: اسم الجروب موجود من قبل

source: Group name is required.
ar: اسم المجموعة مطلوب

source: Group name must not exceed 200 characters.
ar: يجب ألا يتجاوز اسم المجموعة 200 حرف

source: Group not found
ar: المجموعة غير موجودة

source: Group with the same name already exists
ar: توجد مجموعة بنفس الاسم بالفعل

source: Guardian must have pickup authorization.
ar: يجب أن يكون لدى الوصي التعليمي الأساسي تصريح بالاستلام

source: Guardian status must be specified.
ar: يجب تحديد حالة الوصي

# HomeAddressMaxLength
source: Home address cannot exceed 300 characters.
ar: عنوان السكن لا يجب أن يتجاوز 300 حرف

source: Homeroom Teacher Id Is Required
ar: المعلّم المسؤول عن الفصل مطلوب

source: Icon Cannot Exceed 100 Characters
ar: الرمز لا يمكن ان بتجاوز ال 100 حرف

source: Icon Is Required
ar: الرمز مطلوب

source: Id is required.
ar: الكود مطلوب

source: Id Is Required
ar: الكود مطلوب

source: Invalid Channel Type
ar: نوع القناة غير صالح

# InvalidClassId
source: ClassId is invalid
ar: قيمة الفصل غير صحيحة

source: Invalid email address.
ar: البريد الإلكتروني غير صالح

source: Invalid Email Or Password
ar: بريد إلكتروني أو كلمة مرور غير صحيحة

source: Invalid gender value.
ar: قيمة النوع غير صالحة

source: Invalid ID format
ar: تنسيق المعرف غير صالح

source: InvalidI nput
ar: الإدخال غير صالح

source: Invalid Language Code
ar: رمز لغة غير صالح

source: Invalid Module Name
ar: اسم الوحدة غير صالح

source: Invalid Or Expired OTP
ar: OTP غير صالح أو منتهي

source: Invalid password
ar: كلمة المرور غير صحيحة.

source: Invalid religion value.
ar: قيمة الديانة غير صالحة

source: Invalid request
ar: طلب غير صالح

source: Invalid status format
ar: تنسيق الحالة غير صالح

source: Invalid task id
ar: رقم تعريف التاسك غير صالح

source: Invalid task status
ar: حالة المهمة غير صالحة

source: Invalid token
ar: غير صالح.

source: Invalid token format
ar: تنسيق غير صالح.

source: Invalid User
ar: مستخدم غير صالح

source: Invalid User Data
ar: بيانات مستخدم غير صالحة

source: Invalid User Old Password
ar: كلمة مرور المستخدم القديمة غير صحيحة

# IsArchiveIsRequired
source: IsArchive Required
ar: حقل الأرشفة مطلوب

source: Job Title is required.
ar: المسمى الوظيفي مطلوب.

# JobTitleMaxLength
source: Job Title must not exceed 50 characters.
ar: يجب ألا يتجاوز المسمى الوظيفي 50 حرفا.

source: Language Code Cannot Exceed 5 characters
ar: اللغة لا يمكن أن تتجاوز 5 أحرف

source: Language Code Is Required
ar: اللغه مطلوبة

source: Lessons Is Required
ar: يجب ادخال الدروس

source: Letter Grade Is Required
ar: يجب ادخال الدرجة الحرفية

source: Letter Grade Must Not Exceed 5 Characters
ar: يجب ألا يتجاوز الدرجة 5 أحرف

# LoginFirstMessage
source: Please Login First
ar: سجل الدخولا اولا

source: Login Successfully
ar: تسجيل الدخول بنجاح.

source: Logout Successfully
ar: تسجيل الخروج بنجاح

source: Max Capacity Is Required
ar: الحد الأقصى لعدد الطلاب في الفصل مطلوب

source: Max Capacity Of Classes Is Required
ar: الحد الأقصى لعدد الطلاب في الفصل مطلوب

source: Max Number Of Classes Is Required
ar: الحد الأقصى لعدد الفصول مطلوب.

# MaxPortalAccessParentsExceeded
source: You cannot select more than {maxPortalAccessCount} parents with portal access
ar: لا يمكنك اختيار أكثر من {maxPortalAccessCount} من أولياء الأمور الذين لديهم صلاحية الدخول الي الموقع

source: Menus main not found
ar: القائمة غير موجودة

source: Menus Not Found
ar: القائمة غير موجودة

# MinimumMaxCapacityValid
source: The Max Capacity Of Classes Value must be greater than or equal to 1.
ar: يجب أن تكون قيمة لحد الأقصى لعدد الطلاب في الفصل أكبر من أو تساوي 1

# MinmumMaxNumberOfClassesValid
source: he Max Number Of Classes Value must be greater than or equal to 1.
ar: يجب أن تكون قيمة الحد الأقصى لعدد الفصول أكبر من أو تساوي 1.

source: Module Name Cannot Exceed 100 characters
ar: اسم الوحدة لا يمكن أن يتجاوز 100 حرف

source: Module Name Is Required
ar: اسم الوحدة مطلوب

source: Name cannot exceed 100 characters
ar: لا يمكن أن يتجاوز الإسم 100 حرف

source: Name Already Exists
ar: الاسم موجود من قبل

source: Name Cannot Exceed 100 characters
ar: الاسم لا يمكن أن يتجاوز 100 حرف

source: Name Cannot Exceed 150 Characters
ar: الاسم لا يمكن ان يتجاوز ال 150 حرف

source: Name is required.
ar: الاسم مطلوب

# NameMaxLength
source: Name must not exceed 100 characters.
ar: يجب ألا يتجاوز الاسم 100 حرف

# NameMustContainFirstAndLastName
source: Name must have contain first name and last name
ar: الاسم يجب أن يحتوي على الاسم الأول والأخير

source: National ID is required.
ar: الرقم القومي مطلوب

# NationalIdLength
source: National ID must be exactly 14 digits.
ar: يجب أن يتكون الرقم القومي من 14 رقمًا

# NationalIdNumbersOnly
source: National ID must contain only numbers.
ar: يجب أن يحتوي الرقم القومي على أرقام فقط

source: NationalityId is required.
ar: الجنسية مطلوبة

source: Nationality is required.
ar: الجنسية مطلوبة

source: No comments for this task
ar: لا توجد تعليقات لهذه المهمه

source: No default operations
ar: لا توجد عمليات افتراضية

source: No logs found for this task
ar: لم يتم العثور على سجلات لهذه المهمة

source: No Members Available To Assign
ar: لا يوجد اعضاء للتعين

source: No new coordinators to assign.
ar: لا يوجد منسقون جدد للتعيين

source: No new students to assign.
ar: لا يوجد طلاب جدد للتعيين

source: No operations for role
ar: لا توجد عمليات لهذا الدور

source: No parents found for application
ar: لم يتم العثور على أولياء أمور لهذا الطلب

source: No parents found for student
ar: لم يتم العثور على أولياء أمور للطالب

source: No Permission
ar: لا يوجد لديك صلاحية

# NoProjectsInThisTeam
source: No projects assigned to this team
ar: لا توجد مشاريع مسندة لهذا الفريق

source: No relatives found for Application.
ar: لم يتم العثور على أقارب لهذا الطلب

source: No relatives found for student
ar: لم يتم العثور على أقارب للطالب

# NoTeamsFoundForThisProject
source: No teams assigned to this project
ar: لا توجد فرق مسندة لهذا المشروع

# NotesMustBeLessOrEqual1000Chars
source: Notes must be ≤ 1000 characters.
ar: يجب أن تكون الملاحظات أقل من أو تساوي 1000 حرف

source: Not Found
ar: لا يوجد

source: Notifications Reset Successfully
ar: تم اعادة تعيين الاشعارات بنجاح

# NoUnassignedTeamsAvailable
source: No available teams to assign
ar: لا توجد فرق متاحة للإسناد

source: No unassigned users available
ar: لا يوجد مستخدمون متاحون

source: No Valid Users
ar: المستخدم غير موجود.

source: Occupation Id is required.
ar: المهنة مطلوبة

source: Operation failed
ar: فشلت العملية

source: Parent comment not found
ar: م يتم العثور على التعليق الأصلي

source: Parent deleted successfully
ar: تم حذف ولي الامر بنجاح

# ParentEmailAlreadyExists
source: Parent '{0}' email already exists in the Organization module.
ar: البريد الإلكتروني للولي '{0}' موجود بالفعل في موديول المؤسسة

source: Parent not found
ar: ولي الامر غير موجود

# ParentPhoneAlreadyExists
source: Parent '{0}' phone already exists in the Organization module.
ar: رقم هاتف الولي '{0}' موجود بالفعل في موديول المؤسسة.

source: Parents with portal access
ar: أولياء الأمور الذين لديهم صلاحية الدخول إلى الموقع

source: Parent task updated successfully
ar: تم تحديث المهمة الأصل بنجاح

source: ParentType is invalid or not specified.
ar: نوع ولي الأمر غير صالح أو غير محدد

source: Pass limit cannot be greater than total degree.
ar: حد النجاح لا يمكن أن يكون أكبر من الدرجة الكلية

source: Pass Limit Is Required
ar: حد المرور مطلوب

source: Password Changed Successfully
ar: تم تغيير كلمة المرور بنجاح

source: Password is required.
ar: كلمة المرور مطلوبة.

# PasswordMust6CharactersLong
source: Password must be at least 6 characters long.
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# PasswordMustContainAtLeastOneDigit
source: Password must contain at least one digit (0-9).
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل (0-9)

# PasswordMustContainAtLeastOneLowercaseLetter
source: Password must contain at least one lowercase letter (a-z).
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل (a-z)

# PasswordMustContainAtLeastOneUppercaseLetter
source: Password must contain at least one uppercase letter (A-Z).
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل (A-Z)

source: Performance Level Is Required
ar: يجي ادخال مستوى الأداء

source: Performance Level Must Not Exceed 100 Characters
ar: يجب ألا يتجاوز مستوى الأداء 100 حرف

source: Permissions reset successfully
ar: إعادة تعيين السماح بنجاح

# Phone cannot exceed 100 characters
source: Phone cannot exceed 15 characters
ar: لا يمكن أن يتجاوز الهاتف 15حرف

source: Phone is required
ar: الهاتف مطلوب

source: Phone Already Exists
ar: رقم الهاتف مستخدم من قبل

# PhoneCannotBeWhitespace
source: Phone number cannot be whitespace.
ar: رقم الهاتف لا يمكن أن يكون فارغًا أو مسافات فقط

# PhoneCannotExceed20Characters
source: Phone number cannot exceed 20 characters.
ar: رقم الهاتف لا يجب أن يتجاوز 20 رقمًا

# PhoneInvalidFormat
source: Phone number must be a valid Egyptian phone number.
ar: يجب أن يكون رقم الهاتف رقم هاتف مصري صالح.

# PhoneIsAlreadyExist
source: Phone Already Exists
ar: رقم الهاتف مستخدم من قبل

# PhoneIsRequired
source: Phone number is required.
ar: رقم الهاتف مطلوب.

# PhoneMaxLength
source: Phone number cannot exceed 17 digits.
ar: رقم الهاتف لا يجب أن يتجاوز 17 خانة

source: Please provide valid data for each lesson section.
ar: يجب إدخال بيانات صحيحة لكل قسم من الدرس

source: PrimaryLanguageId is required.
ar: اللغة الأساسية مطلوبة

source: Project Archive Status Updated Successfully
ar: تم تحديث حالة ارشفة المشروع
