Repository: AyaElsifiy/Pearogram.BuildingBlocks
Catalog: Pearogram.BuildingBlocks.Application/Common/SharedResources/GeneralMessages.*.resx
Languages: ar

# ProjectIsAlreadyArchive
source: Project is already archived
ar: المشروع مؤرشف بالفعل

source: Project not found
ar: المشروع غير موجود

source: Qualifications are required.
ar: المؤهلات مطلوبة

# QualificationsMaxLength
source: Qualifications cannot exceed 300 characters
ar: المؤهلات لا يجب أن تتجاوز 300 حرف

source: Rank Is Required
ar: يجب ادخال الترتيب

source: reached
ar: لقد وصلت إلى الحد الأقصى المسموح.

source: RegionId is required.
ar: المنطقة مطلوبة

source: Region is required.
ar: المنطقة مطلوبة

source: Related Event Not Allowed
ar: الحدث المرتبط غير مسموح

source: Related Event Required
ar: الحدث المتعلق مطلوب

# RelatedToIsRequired
source: Related Type Is Required
ar: المتعلق به مطلوب

source: Religion is invalid or not specified.
ar: يرجى اختيار ديانة صحيحة

source: Report genrated successfully
ar: تم انشاء التقرير بنجاح

# RequestDataInvalidOrMissing
source: Request data is invalid or missing.
ar: بيانات الطلب غير صالحة أو مفقودة.

source: Reset Notifications Error
ar: خطأ في اعادة تعيين الاشعارات

source: Reset permissions error
ar: خطأ إعادة تعيين الأذونات

# RestoreSuccessfully
source: Restored successfully
ar: تمت الاستعادة بنجاح

source: Role already exist
ar: هذا الدور يوجد من قبل

source: Role id is required
ar: يجب ادخال الدور

source: Role is required.
ar: الدور مطلوب.

source: Role not found
ar: هذا الدور لا يوجد

source: SecondLanguageIdMustBeNonEmptyGuid
ar: إذا تم إدخال اللغة الثانية، فيجب أن يكون القيمه غير فارغ

source: Sections Is Required
ar: يجب ادخال السيكشن الخاص بالدرس

# SelectionLimitExceeded
source: You cannot select more than
ar: لا يمكنك اختيار أكثر من

source: Send OTP Email Succesfully
ar: تم إرسال بريد OTP بنجاح

source: Slot name cannot be whitespace
ar: لا يمكن أن يكون اسم الفترة فراغًا

source: Slot name is required.
ar: اسم الفترة مطلوب

# SlotNameMustBeLessOrEqual255Chars
source: Slot name must be ≤ 255 characters.
ar: يجب أن يكون اسم الفترة أقل من أو يساوي 255 حرفًا

source: Some Classes not found.
ar: بعض الفصول لم يتم العثور عليها

source: Some Lessons Not Found
ar: بعض الدروس غير موجوده

source: Some Sections Not Found
ar: بعض السيكشن غير موجود

source: Some SubjectGradeConfigs not found.
ar: بعض إعدادات مواد الصف لم يتم العثور عليها

source: Start Date Is Required
ar: تاريخ البدايه مطلوب

source: StartDate must be before EndDate
ar: تاريخ البداية لازم يكون قبل تاريخ النهاية

source: Start Date Must Be Less Than End Date
ar: وقت البداية يجب ان يكون قبل وقت النهاية

source: Start time is required.
ar: تاريخ البدايه مطلوب

source: Student Academic Data Not Found
ar: بيانات الطالب الاكادميه غير موجوده

# StudentAlreadyExists
source: Student with the same NationalId, Email, or Phone already exists
ar: يوجد طالب بنفس الرقم القومي أو البريد الإلكتروني أو رقم الهاتف

source: Student must be at least
ar: يجب أن يكون عمر الطالب على الأقل

# StudentMustHaveFather
source: Each student must have a father assigned.
ar: يجب تعيين أب لكل طالب

# StudentMustHaveMother
source: Each student must have a mother assigned.
ar: يجب تعيين أم لكل طالب

source: Student not found
ar: لم يتم العثور على الطالب

source: Student not found in the group.
ar: لم يتم العثور على الطالب في المجموعة

source: Student removed from the group successfully.
ar: تمت إزالة الطالب من المجموعة بنجاح

source: Students assigned successfully.
ar: تم تعيين الطلاب بنجاح

source: Students list is required.
ar: قائمة الطلاب مطلوبة

source: StudyPathId is invalid
ar: مسار الدراسة غير موجود

# StudyPathIdMustBeNonEmptyGuid
source: StudyPathId, if provided, must be a non-empty GUID.
ar: إذا تم إدخال مسار الدراسة، فيجب أن يكون المعرّف GUID غير فارغ

source: Study Path Ids Is Required
ar: مسار التعليم مطلوب

source: Study Path Not Found
ar: مسار الدراسة غير موجود

# SubjectGradeConfigIdsContainEmptyGuid
source: SubjectGradeConfigIds contains empty Guid.
ar: إعدادات مواد الصف تحتوي على قيمة فارغة

source: Subject grade config not found.
ar: لم يتم العثور على إعداد المادة للصف

source: Subject Grade Configuration must be a valid Guid if provided.
ar: يجب أن يكون المادة من نوع GUID

source: Subject Grade Is Required
ar: يجب ادخال المادة

source: Subject Not Found
ar: الماده غير موجوده

source: Subjects contain invalid IDs.
ar: المواد تحتوي على قيم غير صالحة

source: Subjects must be unique.
ar: يجب ألا تتكرر المواد

source: Success
ar: تم بنجاح

source: Task assignee changed successfully
ar: تم تغيير المكلف بالمهمة بنجاح

source: Task Converted Successfully
ar: تم تحويل الشكوى الى مهمه بنجاح

# TaskExistingBefore
source: Task already exists.
ar: المهمة موجودة بالفعل

source: Task not assign for a team
ar: هذه المهمه غير مخصصه لهذا فريق

source: Task not found
ar: المهمة غير موجودة

source: Task priority changed successfully
ar: تم تغيير أولوية المهمة بنجاح

source: Task status updated successfully
ar: تم تحديث حالة المهمة بنجاح

source: Task Type Changed Successfully
ar: تم تحديث نوع المهمه بنجاح

source: Teacher assigned successfully.
ar: تم تعيين المعلم بنجاح

source: Teacher archive failed.
ar: حدث خطا اثناء أرشفة المعلم

# TeacherArchiveSuccess
source: Teacher archived successfully.
ar: تمت أرشفة المعلم بنجاح

# TeacherAssignedSuccess_NoChanges
source: Teacher assigned successfully, no changes.
ar: تم تعيين المعلم بنجاح، دون أي تغييرات

source: Teacher Assignment Failed
ar: حدث خطا اثناء تعيين المعلم

source: Teacher Delete Failed
ar: حدث خطا اثناء حذف المدرس

source: Teacher Delete Success
ar: تم حذف المدرس بنجاح

source: Teacher Not Found
ar: المدرس غير موجود

source: Teacher with this email already exists.
ar: يوجد مدرس بهذا البريد الإلكتروني بالفعل

source: Teacher with this name already exists.
ar: يوجد مدرس بنفس الاسم بالفعل

source: Team not found
ar: الفريق غير موجود

source: Term End Date Is Required
ar: نهاية الترم مطلوب

source: Term Ids Is Required
ar: الفصول الدراسيه مطلوب

source: Term name is required
ar: اسم الترم مطلوب

source: Term names must be unique
ar: يوجد أسماء مكررة للترمات

source: Terms must not overlap
ar: يجب ألّا تتداخل الفترات الزمنية في الترم .

source: Terms Not Found
ar: الفصل الدراسي غير موجود

# TermsRequired
source: Terms Is Required
ar: الترم مطلوب

source: Term Start Date Is Required
ar: بداية الترم مطلوب

source: Term start must be within the academic year
ar: بداية الترم لازم تكون داخل فترة السنة

# TheCodeOfClassMustBeUnique
source: The Code Of Grade Must Be Unique
ar: كود الفصل مستخدم من قبل، يرجى اختيار اسم مختلف

source: The Code Of Grade Must Be Unique
ar: كود الصف مستخدم مسبقًا، يرجى إدخال كود مختلف.

source: The Home Room Teacher Ids of Classes Value must be less than or equal to
ar: يجب ان يكون عدد المعلم المسؤل عن الفصل أقل من أو تساوي

source: The Homeroom Teacher Of Classes Value must be greater than or equal to 1.
ar: يجب أن تكون قيمة لحد الأقصى المعلّم المسؤول عن الفصل أكبر من أو تساوي 1

source: The Max Capacity Of Classes Value must be greater than or equal to 1.
ar: يجب أن تكون قيمة لحد الأقصى لعدد الطلاب في الفصل أكبر من أو تساوي 1

# TheMaxNumberOfClassesValueMustBeGreaterThanOrEqualTo1
source: he Max Number Of Classes Value must be greater than or equal to 1.
ar: يجب أن تكون قيمة الحد الأقصى لعدد الفصول أكبر من أو تساوي 1.

source: The Max Number Of Classes Value must be less than or equal to
ar: يجب ألا تتجاوز قيمة الحد الأقصى لعدد الفصول العدد المسموح به.

source: The Name Of Academic Year Must Be Unique
ar: اسم السنه موجوده من قبل

source: The Name Of Class Must Be Unique
ar: اسم الفصل مستخدم من قبل، يرجى اختيار اسم مختلف

source: The Name Of Education Track Must Be Unique
ar: لا يمكن تكرار اسم المسار التعليمي، الرجاء اختيار اسم مختلف.

source: The Name Of Grade Must Be Unique
ar: هذا الاسم مستخدم لصف دراسي آخر، يرجى تغييره.

source: The name of study path must be unique.
ar: تمت اضافة اسم المسار الدراسي من قبل

source: The Name Of Subject Must Be Unique
ar: اسم الماده تم اضافته من قبل

# Thestudentgradedoesnotmatchtheclassgrade
source: The student's grade does not match the class grade.
ar: الصف الدراسي للطالب لا يطابق الصف الدراسي للفصل.

source: This action not allow for user and member
ar: هذا الإجراء لا يسمح للمستخدم والعضو

source: This member already exist in this team
ar: هذا العضو موجود في هذا الفريق بالفعل

source: This Member Exist Before
ar: العضو موجود من قبل

source: This Name Exists Before
ar: هذا الاسم موجود من قبل

source: This Project Added To This User Before
ar: تم اضافة هذا المشروع لهذا المسنخدم من قبل

# ThisProjectExistBefore
source: This project already exists
ar: هذا المشروع موجود بالفعل

# ThisProjectExistsBefore
source: This project already exists
ar: هذا المشروع موجود بالفعل

# ThisTeamExistInSameProjectBefore
source: Team already exists in this project
ar: هذا الفريق موجود علي المشروع من قبل

source: Ticket Assignee Changed Successfully
ar: تم تغيير التعيين بنجاح

source: Ticket Converted Task Before
ar: لقد تم تحويل هذا الطلب الى مهمه من قبل

source: Ticket Status Cannot Be Change To This Status Only Closed Allowed
ar: حالة الطلب لا يمكن تغييرها إلى هذه الحالة فقط مغلقة مسموح بها

source: Ticket Status Updated Successfully
ar: تم تحديث حالة الشكوى بنجاح

source: Ticket With This Status Cannot Be Converted Must Be Open
ar: لا يمكن تحويل الطلب بهذه الحالة، يجب أن تكون مفتوحة

source: TimeLine report generated successfully
ar: تم إنشاء تقرير الجدول الزمني بنجاح

source: Timer paused successfully
ar: تم إيقاف المؤقت بنجاح

source: Timer starting successfully
ar: تم بدء المؤقت بنجاح

source: Timer stopped successfully
ar: تم إيقاف المؤقت بنجاح

source: Title Cannot Exceed 300c haracters
ar: العنوان لا يمكن أن يتجاوز 300 حرف

source: Title Is Required
ar: العنوان مطلوب

source: To Age Is Required
ar: من فضلك أدخل العمر الي

source: Token has been invalidated
ar: تم إبطال

source: Topic Is Required
ar: الموضوع مطلوب

source: Topic Not Found
ar: الموضوع ليس موجود

source: Total degree cannot exceed 100.
ar: الدرجة الكلية لا يجب أن تكون اكبر من 100

source: Total Degree Is Required
ar: الدرجة الكلية مطلوبة

source: TypeId is required.
ar: النوع مطلوب

source: TypeId must be a valid Guid.
ar: يجب أن يكون النوع من نوع GUID

source: Type Is Required
ar: نوع الماده مطلوب

source: Type Not Found
ar: لا يوجد هذا النوع

source: Type of entity is required
ar: حدد النوع

source: Unauthorized
ar: غير مصرح

source: Updated Successfully
ar: تم التحديث بنجاح

source: Update Failed
ar: حدث خطا اثناء التعديل

source: Uploaded Successfully
ar: تم الرفع بنجاح

# UseInternationalFormatE164
source: Use international format (E.164), e.g., +201001234567.
ar: استخدم التنسيق الدولي (‎E.164‎)، مثال: ‎+201001234567‎

source: User active status updated successfully
ar: تم تحديث حالة المستخدم بنجاح

source: User archive status updated successfully
ar: تم تحديث حالة أرشفة المستخدم بنجاح

# UserAssignToThisRoleBefore
source: User is already assigned to this role
ar: المستخدم مُعيَّن بالفعل لهذهِ المهمة

source: User deleted successfully
ar: تم حذف المستخدم بنجاح

source: User is already exists with this email
ar: يوجد مستخدم مسجل بالفعل بهذا البريد الإلكتروني

# UserIsAlreadyExistsWithThisPhone
source: User is already exists with this phone number
ar: يوجد مستخدم مسجل بالفعل بهذا رقم الهاتف

# UserNameInvalidFormat
source: User Name must have space
ar: يجب ادخال الاسم صحيح

source: User Not Active
ar: المستخدم غير نشط

source: User Not Found
ar: المستخدم غير موجود.

source: User Verifed Successfully
ar: تم التحقق من المستخدم بنجاح

source: Year start must be before year end
ar: بداية السنة لازم تكون قبل نهايتها

# YouCan'tRestoreThisItem
source: This item can't be restored (older than 30 days)
ar: لا يمكن استعادة هذا العنصر (أقدم من 30 يومًا)

source: Applications assigned successfully
ar: تم تعيين الطلبات بنجاح

# Error.Ticket.MustBeOpenToConvert
source: Conversion is only allowed for tickets with status 'Open'. Please open the ticket first.
ar: لا يمكن تحويل التذكرة إلا إذا كانت حالتها مفتوحة. يرجى فتح التذكرة أولاً قبل التحويل.

# Success.Ticket.Converted
source: Ticket converted successfully.
ar: تم تحويل التذكرة بنجاح.

# PHONE_START_PLUS
source: Phone number must start with '+' followed by the country code
ar: يجب أن يبدأ رقم الهاتف بـ '+' ثم رمز البلد

# NameMaxLegnth
source: Name must not exceed 100 characters
ar: يجب ألا يتجاوز الاسم 100 حرف

source: Company Not Found
ar: الشركة غير موجودة

source: The phone is already in use
ar: رقم الموبايل مستخدم من قبل

source: The email is already in use
ar: هذا الايميل مستخدم من قبل

source: Task has no assignee.
ar: المهمة غير مُسندة.

source: Archive Failed
ar: حدث خطأ أثناء التعديل

source: Archive Success
ar: تم التعديل بنجاح

source: Student Id Required
ar: يجب ادخال الطالب

source: Exam Publish Id Required
ar: يجب ادخال نشر الامتحان

source: Score Must Be Positive
ar: المجموع يجب ان يكون موجب

source: Question Id Required
ar: يجب ادخال السؤال

source: Submit Time Required
ar: وقت الإرسال مطلوب

source: Exam Type Not Null
ar: يجب ادخال نوع الامتحان

# ImmediateResultsAndShowResultsDateValidation
source: If immediate results are enabled, you must provide a results display date and select a subject grade configuration.
ar: إذا تم تفعيل إظهار النتيجة فورًا، يجب تحديد تاريخ عرض النتيجة واختيار إعدادات تقييم المادة.

source: Invalid Exam Type
ar: قيمة نوع الامتحان غير صحيحة

# IsOfflineAndAssignTypeValidation
source: If the exam is Offline, you must select an Assign Type (Classes or Groups) and provide at least one class or one group.
ar: إذا كان الامتحان في وضع Offline، يجب اختيار نوع التوزيع (صفوف أو مجموعات) وتحديد صف واحد على الأقل أو مجموعة واحدة على الأقل

# IsRelatedToSubjectAndSubjectValidationMessage
source: If the exam is linked to a subject, you must provide a subject value; and if it is not linked to a subject, the subject value must be left null.
ar: إذا كان الامتحان مرتبطًا بمادة فيجب إدخال قيمة المادة، وإذا لم يكن مرتبطًا بمادة فيجب ترك قيمة المادة فارغة.

# ScopeTypeAndScopeIdValidationMessage
source: Please enter valid data: If the scope type is General, no topic or lesson should be selected. If the scope type is Specific Topic, a topic must be selected and lesson must be empty. If the scope type is Specific Lesson, a lesson must be selected only.
ar: برجاء إدخال البيانات بشكل صحيح: إذا كان نوع النطاق عامًا (General)، يجب عدم اختيار موضوع أو درس. إذا كان النطاق خاصًا بموضوع (Specific Topic)، يجب اختيار موضوع فقط بدون درس. وإذا كان النطاق خاصًا بدرس (Specific Lesson)، يجب اختيار درس فقط.

source: Score Cannot Exceed 100 points
ar: الدرجة لا يجب ان تتخطي ال 100

source: Score Greater Than Zero
ar: درجة يجب ان تكون اكبر من 0

source: Title Not Null
ar: يجب ادخال العنوان

source: Question not found
ar: السؤال غير موجود

source: Parent question not found
ar: السؤال الرئيسي غير موجود

# QuestionCreated
source: Question created successfully
ar: تم إنشاء السؤال بنجاح

source: Subject/Grade not found
ar: لم يتم العثور على إعدادات المادة/الصف

source: Subject is required
ar: المادة مطلوبة

source: Invalid question type
ar: نوع السؤال غير صحيح

source: Invalid scope type
ar: نوع النطاق غير صحيح

# ScopeIdIsRequiredWhenScopeTypeIsNotGeneral
source: Scope is required when scope type is not general
ar: النطاق مطلوب عندما لا يكون نوع النطاق عامًا

source: Invalid difficulty level
ar: مستوى الصعوبة غير صحيح

source: Invalid visibility setting
ar: إعداد الرؤية غير صحيح

source: Duration must be positive
ar: يجب أن تكون المدة موجبة

source: Question body is required
ar: نص السؤال مطلوب

# EssayCannotBeToAutoGrading
source: Essay questions cannot be set to auto-grading
ar: لا يمكن تصحيح الأسئلة المقالية تلقائيًا

# Non-essayQuestionsAtLeastOneAnswer
source: Non-essay questions must have at least one answer
ar: يجب أن يحتوي السؤال غير المقالي على إجابة واحدة على الأقل

# AtLeastOneAnswerMustAsCorrect
source: At least one answer must be marked as correct
ar: يجب تحديد إجابة واحدة على الأقل كإجابة صحيحة

# EssayQuestionsCannotPredefinedAnswers
source: Essay questions cannot have predefined answers
ar: لا يمكن أن تحتوي الأسئلة المقالية على إجابات محددة مسبقًا

source: Exam not found
ar: الاختبار غير موجود

source: Exam question created successfully
ar: تم إنشاء سؤال الاختبار بنجاح

# QuestionDeleted
source: Question deleted successfully
ar: تم حذف السؤال بنجاح

source: Question ID must not be empty
ar: معرف السؤال لا يمكن أن يكون فارغاً

# QuestionUpdated
source: Question updated successfully
ar: تم تحديث السؤال بنجاح

# QuestionCannotExceed5000Characters
source: Question body cannot exceed 5000 characters
ar: لا يمكن أن يتجاوز نص السؤال 5000 حرف

# TypeNotNull
source: Question Type is required
ar: نوع السؤال مطلوب

# DifficultyNotNull
source: Difficulty level is required
ar: مستوى الصعوبة مطلوب

# ExamIdRequired
source: Exam ID is required
ar: معرف الاختبار مطلوب

source: Single choice question must have at least two answers
ar: يجب أن يحتوي سؤال الاختيار الفردي على إجابتين على الأقل

source: Multiple choice question must have at least two answers
ar: يجب أن يحتوي سؤال الاختيار المتعدد على إجابتين على الأقل

# AtLeastOneCorrectAnswerRequired
source: At least one correct answer is required
ar: مطلوب إجابة صحيحة واحدة على الأقل

source: Topic Archive Success
ar: تم أرشفة الموضوع بنجاح

source: Error In Cancel Exam Publishs
ar: حدث خطا اثناء الغاء الامتحان

source: Finish Evalation Successfully
ar: تم انتهاء التصحيح بنجاح

source: Exam Published Successfully
ar: تم نشر الامتحان بنجاح
